<?php

use yii\db\Migration;

/**
 * Class m171122_193129_invoices_list
 */
class m171122_193129_invoices_list extends Migration
{
    /**
     * @inheritdoc
     */
    public function safeUp()
    {
        $list = [
            ['Медико-биологическое отделение', 'МБО'],
            ['Отделение сепарационных методов анализа', 'ОСМА'],
            ['Организационный отдел', 'ОО'],
            ['Отдел разработок обучения и сервиса', 'ОРОС'],
            ['Отдел продаж', 'ОП'],
            ['Научно-экспертный отдел', 'НЭО'],
            ['Отдел внешнеэкономической деятельности', 'ОВЭД'],
            ['Отдел международной логистики и координации', 'ОМЛК'],
            ['Аналитический отдел', 'АО'],
            ['Отдел маркетинговых коммуникаций', 'ОМК'],
            ['Спектрометрическое отделение', 'СО'],
            ['Бухгалтерия Люмэкс-Маркетинг', 'БухЛМ'],
            ['Дирекция (УК)', 'Дир'],
            ['Информационная служба до 07.11.17', 'ИС'],
            ['Кадровая Служба', 'КС'],
            ['Метрологическая служба (УК)', 'МС'],
            ['Служба главного инженера', 'СГИ'],
            ['Служба Системы качества', 'ССК'],
            ['Экономический отдел', 'ЭО'],
            ['Патентно-Лицензионное Бюро', 'ПЛБ'],
        ];

        foreach ($list as $row) {
            $this->update('department', ['short_name' => $row[1]], ['name' => $row[0]]);
        }

        $this->addColumn('user', 'short_name', $this->string(50)->after('code_1c'));
        $this->update('user', ['short_name' => new \yii\db\Expression('code_1c')]);
    }

    /**
     * @inheritdoc
     */
    public function safeDown()
    {
        $this->dropColumn('user', 'short_name');
    }
}
